export const FEEDBACK_MAP = [
  {
    id: 1,
    question:
      "Я полагаю, что мог бы внести большой вклад на такой работе, где:",
    variants: {
      a: "Хорошая заработная плата и прочие вознаграждения ",
      b:
        "Имеется возможность установить хорошие взаимоотношения с коллегами по работе",
      c:
        "Я мог бы влиять на принятие решений и демонстрировать свои достоинства как работника",
      d: "У меня ест возможность совершенствоваться и расти как личность"
    }
  },
  {
    id: 2,
    question: "Я не хотел бы работать там, где",
    variants: {
      a: "Отсутствуют чёткие указания, что от меня требуется ",
      b:
        "Практически отсутствует обратная связь и оценка эффективности моей работы ",
      c: "То, чем я занимаюсь, выглядит малополезным и малоценным",
      d: "Плохие условия работы, слишком шумно и (или) грязно"
    }
  },
  {
    id: 3,
    question: "Для меня важно, чтобы моя работа",
    variants: {
      a: "Была связана со значительным разнообразием и переменами",
      b: "Давала мне возможность работать с широким кругом людей",
      c:
        "Обеспечивала мне чёткие указания, чтобы я знал, что от меня требуется ",
      d: "Позволяла мне узнать тех людей, с которыми я работаю"
    }
  },
  {
    id: 4,
    question: "Я полагаю, что меня не очень заинтересует работа, которая:",
    variants: {
      a: "Обеспечивала бы мне мало контактов с другими людьми",
      b: "Едва ли была замечена другими людьми",
      c:
        "Не имела бы конкретных очертаний, так что я был бы уверен, что от меня требуется",
      d: "Была бы сопряжена с определённым объёмом рутинных операций"
    }
  },
  {
    id: 5,
    question: "Работа мне нравится, если:",
    variants: {
      a: "Я чётко представляю себе, что от меня требуется",
      b: "У меня удобное рабочее место и меня мало отвлекают",
      c: "У меня хорошее вознаграждение и заработная плата ",
      d: "Позволяет мне совершенствовать свои профессиональные навыки"
    }
  },
  {
    id: 6,
    question: "Полагаю, что мне бы понравилось, если:",
    variants: {
      a: "Были бы хорошие условия работы и отсутствовало давление на меня ",
      b: "У меня был бы очень хороший оклад",
      c:
        "Работа в действительности была бы полезна и приносила бы мне удовлетворение",
      d: "Мои достижения и работа оценивались бы по достоинству"
    }
  },
  {
    id: 7,
    question: "Я не считаю, что работа должна:",
    variants: {
      a:
        "Быть слабо структурированной, так что непонятно, что же следует делать",
      b: "Предоставлять слишком мало возможностей хорошо узнать других людей",
      c:
        "Быть малозначимой или малополезной для общества и неинтересной для выполнения ",
      d:
        "Оставаться непризнанной, или её выполнение должно восприниматься как само собой разумеющееся "
    }
  },
  {
    id: 8,
    question: "Работа приносящая удовлетворение:",
    variants: {
      a:
        "Связана со значительным разнообразием, переменами, стимуляцией энтузиазма",
      b:
        "Даёт возможность совершенствовать свои профессиональные качества и развиваться как личность",
      c: "Является полезной и значимой для общества",
      d:
        "Позволяет мне проявлять творческий подход и экспериментировать с новыми идеями"
    }
  },
  {
    id: 9,
    question: "Важно, чтобы работа:",
    variants: {
      a: "Признавалась и ценилась организацией, где я работаю",
      b:
        "Давала бы возможности для профессионального роста и совершенствования ",
      c: "Была бы сопряжена с большим разнообразием и переменами ",
      d: "Позволяла бы сотруднику оказывать влияние на других"
    }
  },
  {
    id: 10,
    question: "Я не считаю, что работа будет приносить удовлетворение, если:",
    variants: {
      a:
        "В процессе её выполнения мало возможностей осуществлять контакты с разными людьми",
      b: "Оклад и вознаграждение очень хорошие ",
      c:
        "Я не могу установить и поддерживать добрые отношения с коллегами по работе ",
      d:
        "У меня очень мало самостоятельности или возможностей для проявления гибкости"
    }
  },
  {
    id: 11,
    question: "Самой хорошей является такая работа, которая:",
    variants: {
      a: "Обеспечивает хорошие рабочие условия",
      b: "Даёт чёткие инструкции и разъяснения по поводу содержания работы ",
      c: "Предполагает выполнение интересных и полезных заданий ",
      d:
        "Позволяет получить признание личных достижений и качества выполненной работы "
    }
  },
  {
    id: 12,
    question: "Вероятно, я не буду хорошо работать, если",
    variants: {
      a: "Имеется мало возможностей ставить перед собой цели и достигать их",
      b: "Я не имею возможности совершенствовать свои личностные качества",
      c:
        "Тяжёлая работа не получает признания и соответствующего вознаграждения ",
      d: "На рабочем месте пыльно, грязно и шумно"
    }
  },
  {
    id: 13,
    question: "При определении служебных обязанностей важно:",
    variants: {
      a: "Дать людям возможность лучше узнать друг друга ",
      b: "Предоставить работнику возможность ставить цели и достигать их",
      c: "Обеспечить условия для проявления работниками творческого начала ",
      d: "Обеспечить комфортность и чистоту рабочего места "
    }
  },
  {
    id: 14,
    question: "Вероятно я не захочу работать там, где ",
    variants: {
      a:
        "У меня будет мало самостоятельности и возможностей для совершенствования личности",
      b: "Не поощряются исследования и проявления научного любопытства",
      c: "Очень мало контактов с широким кругом людей",
      d: "Отсутствуют достойные надбавки и дополнительные льготы "
    }
  },
  {
    id: 15,
    question: "Я был бы удовлетворён, если:",
    variants: {
      a:
        "Была бы возможность оказывать влияние на принятие решений другими работниками ",
      b: "Работа предоставляла бы широкое разнообразие и перемены",
      c: "Мои достижения были бы оценены другими людьми ",
      d: "Я точно знал бы, что от меня требуется и как это нужно выполнить"
    }
  },
  {
    id: 16,
    question: "Работа меньше удовлетворяла бы меня, если:",
    variants: {
      a: "Не позволяла бы ставить и добиваться сложных целей",
      b: "Я чётко не знал бы правил и процедур выполнения работ",
      c:
        "Уровень оплаты моего труда не соответствовал бы уровню сложности выполняемой работы",
      d:
        "Я практически не мог бы влиять на принимаемые решения и на то, что делают другие "
    }
  },
  {
    id: 17,
    question: "Я полагаю, что должность должна представлять:",
    variants: {
      a:
        "Чёткие должностные инструкции и указания на то, что от меня требуется",
      b: "Возможность лучше узнать своих коллег по работе ",
      c: "Возможность выполнять сложные производственные задания ",
      d: "Разнообразие, перемены и поощрения "
    }
  },
  {
    id: 18,
    question: "Работа приносила бы мне меньше удовлетворения, если:",
    variants: {
      a: "Не допускала бы возможности хотя бы небольшого творческого вклада ",
      b:
        "Осуществлялась бы изолированно, т.е. работник должен был бы работать в одиночестве",
      c:
        "Отсутствовал бы благоприятный внутренний климат и возможности профессионального роста ",
      d: "Не давала бы возможности оказывать влияние на принятие решений "
    }
  },
  {
    id: 19,
    question: "Я хотел бы работать там, где:",
    variants: {
      a: "Другие люди признают и ценят выполняемую мной работу ",
      b:
        "У меня будет возможность оказывать влияние на то, что делают другие работники",
      c: "Имеется достойная система надбавок и дополнительных льгот",
      d: "Можно выдвигать и апробировать новые идеи и проявлять креативность"
    }
  },
  {
    id: 20,
    question: "Вряд ли бы я захотел работать там, где:",
    variants: {
      a: "Не существует разнообразия и перемен в работе ",
      b: "У меня будет мало возможности влиять на принимаемые решения ",
      c: "Заработная плата не слишком высокая ",
      d: "Условия работы недостаточно хорошие "
    }
  },
  {
    id: 21,
    question:
      "Я полагаю, что приносящая удовлетворение работа должна предусматривать:",
    variants: {
      a:
        "Наличие чётких указаний, чтобы работники знали, что от них требуется ",
      b: "Возможность проявлять креативность",
      c: "Возможность встречаться с интересными людьми ",
      d: "Чувство удовлетворения и действительно интересные задания "
    }
  },
  {
    id: 22,
    question: "Работа не будет доставлять удовольствие, если",
    variants: {
      a: "Предусмотрены незначительные надбавки и дополнительные льготы",
      b: "Условия работы некомфортны или в помещении очень шумно",
      c:
        "Работник не имеет возможности сравнивать свою работу с работой других",
      d: "Не поощряются исследования, творческий подход и креативность"
    }
  },
  {
    id: 23,
    question: "Я считаю важным, чтобы работа обеспечивала мне:",
    variants: {
      a: "Множество контактов с широким кругом интересных людей",
      b: "Возможность установления и достижения целей",
      c: "Возможность влиять  на принятие решений ",
      d: "Высокий уровень заработной платы "
    }
  },
  {
    id: 24,
    question: "Я не думаю, чтобы мне нравилась работа, если:",
    variants: {
      a: "Условия работы некомфортны, на рабочем месте грязно или шумно",
      b: "Мало шансов влиять на других людей",
      c: "Мало возможностей для достижения поставленных целей",
      d: "Я не мог бы проявить креативность и предлагать новые идеи"
    }
  },
  {
    id: 25,
    question: "В процессе организации работы важно:",
    variants: {
      a: "Обеспечить чистоту и комфорт рабочего места ",
      b: "Создать условия для проявления работником самостоятельности",
      c: "Предусмотреть возможности разнообразия и перемен",
      d: "Обеспечить человеку возможности контактов с другими людьми "
    }
  },
  {
    id: 26,
    question: "Скорее всего я не захотел бы работать там, где:",
    variants: {
      a: "Условия работы не комфортны",
      b: "Мало возможностей осуществлять контакты с другими людьми ",
      c: "Работа не является интересной и полезной ",
      d: "Работа рутинная и задания редко меняются "
    }
  },
  {
    id: 27,
    question: "Работа приносит удовлетворение вероятно, когда:",
    variants: {
      a: "Люди признают и ценят хорошо выполненную работу",
      b: "Существуют широкие возможности для маневра и проявления гибкости",
      c: "Можно ставить перед собой сложные и смелые цели",
      d: "Существует возможность лучше узнать своих коллег"
    }
  },
  {
    id: 28,
    question: "Мне не понравилась бы работа, которая:",
    variants: {
      a: "Не была бы полезной и не приносила бы чувство удовлетворения",
      b: "Не содержала бы в себе стимула к переменам",
      c: "Не позволяла бы мне устанавливать дружеские отношения с другими ",
      d: "Была бы неконкретной и не ставила бы сложных задач"
    }
  },
  {
    id: 29,
    question: "Я бы проявил стремление работать там, где:",
    variants: {
      a: "Работа интересная и полезная ",
      b: "Люди могут устанавливать длительные дружеские взаимоотношения ",
      c: "Меня бы окружали интересные люди",
      d: "Я мог бы оказывать влияние на принятие решений "
    }
  },
  {
    id: 30,
    question: "Я не считаю, что работа должна:",
    variants: {
      a:
        "Предусматривать, чтобы человек большую часть времени работал в одиночку ",
      b: "Давать мало шансов на признание личных достижений работника",
      c: "Препятствовать установлению взаимоотношений с коллегами",
      d: "Состоять в основном из рутинных обязанностей "
    }
  },
  {
    id: 31,
    question: "Хорошо спланированная работа обязательно:",
    variants: {
      a: "Предусматривает достаточный набор льгот и множество надбавок ",
      b: "Имеет чёткие рекомендации по выполнению и должностные обязанности",
      c: "Предусматривает возможность ставить цели и достигать их",
      d: "Стимулирует и поощряет выдвижение новых идей "
    }
  },
  {
    id: 32,
    question: "Я считал бы, что работа не приносит удовлетворения, если:",
    variants: {
      a: "Не мог бы выполнять сложную перспективную работу",
      b: "Было бы мало возможностей для проявления креативности",
      c: "Допускалась бы малая доля самостоятельности",
      d: "Сама суть работы не представлялась бы полезной "
    }
  },
  {
    id: 33,
    question: "Наиболее важными характеристиками должности являются:",
    variants: {
      a:
        "Возможность для творческого подхода и оригинального нестандартного мышления ",
      b: "Важные обязанности, исполнение которых приносит удовлетворение ",
      c: "Возможность устанавливать хорошие взаимоотношения с коллегами ",
      d: "Наличие значимых целей, которых должен достичь работник "
    }
  }
];
